Австралия/src/Catalogs/CompanyResourceTypes/CompanyResourceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CompanyResourceTypes</name>
  <predefined>
    <items>
      <name>AllResources</name>
      <description>All work center types</description>
    </items>
  </predefined>
  <attributes>
    <name>PlanningOnWorkcentersLevel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ResourceValue</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkCenterTypeNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EachOperationForSingleWC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/CompanyResourceTypes/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If Capacity = 0 Then
		Capacity = 1;
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If Not PlanningOnWorkcentersLevel Then
		
		UsePlanning = Constants.UseProductionPlanning.Get();
		
		If UsePlanning Then
			CheckedAttributes.Add("Capacity");
			CheckedAttributes.Add("Schedule");
		EndIf;
		
	EndIf;
	
	If Ref = Catalogs.CompanyResourceTypes.AllResources Then
		CheckedAttributes.Clear();
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If AdditionalProperties.Property("MarkWorkcentersAvailabilityForDeletion") Then
		
		JobSettings = New Structure;
		JobSettings.Insert("WorkcenterType", Ref);
		
		ExecutionParameters = TimeConsumingOperations.BackgroundExecutionParameters(New UUID);
		ExecutionParameters.WaitForCompletion = 0;
		ExecutionParameters.BackgroundJobDescription = NStr("en = 'Clearing of workcenters availability'; ru = 'Очистка доступности рабочих центров';pl = 'Wyczyszczenie dostępności gniazd produkcyjnych';es_ES = 'Eliminación de la disponibilidad de los centros de trabajo';es_CO = 'Eliminación de la disponibilidad de los centros de trabajo';tr = 'İş merkezleri müsaitlik durumunun silinmesi';it = 'Cancellare disponibilità centri di lavoro';de = 'Verrechnung von Verfügbarkeit der Arbeitsabschnitte'");
		
		TimeConsumingOperations.ExecuteInBackground(
			"ProductionPlanningServer.MarkWorkcentersAvailabilityForDeletion",
			JobSettings,
			ExecutionParameters);
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
